Функция СведенияОВнешнейОбработке() Экспорт    
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Идентификатор");
	ТЗ.Колонки.Добавить("Представление");
	ТЗ.Колонки.Добавить("Использование");
	
	ТЗРег = ТЗ.Добавить();
	ТЗРег.Идентификатор = "ОткрытьФорму";
	ТЗРег.Представление = "Открыть обработку";
	ТЗРег.Использование = "ОткрытиеФормы"; 
	
	ДанныеДляРегистрации = Новый Структура;
	ДанныеДляРегистрации.Вставить("Наименование", "ОтменаРТУ");
	ДанныеДляРегистрации.Вставить("Информация", "Обработка для отмены проведения РТУ");
	ДанныеДляРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ДанныеДляРегистрации.Вставить("Версия", "1.0");
	ДанныеДляРегистрации.Вставить("Команды", ТЗ);
	ДанныеДляРегистрации.Вставить("БезопасныйРежим", Истина);
	
	Возврат ДанныеДляРегистрации;
КонецФункции
