
&НаКлиенте
Процедура ОтменитьПроведение(Команда)
	
	Описание = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	
	Если ЗначениеЗаполнено(КонтрагентВыбор) И ЗначениеЗаполнено(НоменклатураВыбор) Тогда

	ПоказатьВопрос(Описание, "Отменить проведение Реализаций?", РежимДиалогаВопрос.ДаНет, 0);
	
    Иначе
	
	  Сообщить("Сначала заполните поля ""Номенклатура"" и ""Контрагент""!");
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = РежимДиалогаВопрос.ДаНет Тогда
		Возврат;
	Иначе
		ОтменитьПроведениеРеализаций();
	КонецЕсли;
	
	
КонецПроцедуры 

Процедура ОтменитьПроведениеРеализаций()
         	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Контрагент.Ссылка = &Контрагент
		|	И РеализацияТоваровУслуг.Товары.Номенклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Контрагент", КонтрагентВыбор);
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураВыбор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРеализации = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаРеализации.Следующий() Цикл
		
	 РеализацияСсылка = ВыборкаРеализации.Ссылка;
	 РеализацияОбъект = РеализацияСсылка.ПолучитьОбъект();
	 
	 Если РеализацияОбъект.Проведен Тогда 
		 
		 РеализацияОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		 
	 КонецЕсли;
	 
	 
	КонецЦикла;
	
	 
	 
	
КонецПроцедуры


